IDEA Open Model
ReinforcementGroup Properties
Compatible with IDEA StatiCa Beta 20.0
The ReinforcementGroup type exposes the following members.
Properties
Name | Description
Cover
 Cover of reinforcement
CoverFromSetting
 Use cover from DetailModelSetting
Diameter
 Diameter o reinforcement
DiameterOfMandrel
 Diameter of mandrel - multiplier of bar diameter to obtain inner diameter of bent reinforcement bars
EndsTypeBeg
 End type of the beginning of reinforcement bar
EndsTypeEnd
 End type of the end of reinforcement bar
Id
 Element Id
 (Inherited from OpenElementId.)
Material
 Material
 (Inherited from Reinforcement.)
NumOfBarsInLayer
 Number of bars in layer
ReinfId
 Id representing reinforcement in Detail
 (Inherited from Reinforcement.)
Top
See Also
Reference
ReinforcementGroup Class
IdeaRS.OpenModel.Detail Namespace